{"input": "Anthropogenic", "output": "derived from human activities"}
{"input": "Erosion", "output": "The process by which wind, water, ice, or gravity transports soil and sediment from one location to another"}
{"input": "Runoff", "output": "Part of the water cycle where an excess of water runs down and does not sink into the soil and eventually makes it to the rivers, lakes, and oceans."}
{"input": "Denitrification", "output": "process in which fixed nitrogen compounds are converted back into nitrogen gas and returned to the atmosphere"}
{"input": "Nitrification", "output": "ammonia (NH3) is converted to nitrate ions (NO3)-"}
{"input": "Amonification", "output": "the part of the decomposition process where nitrogen in inorganic molecules reaction acids and nucleotides is converted to ammonium"}
{"input": "Nitrogen Fixation", "output": "Process of converting nitrogen gas into ammonia"}
{"input": "Abiotic", "output": "Non-living things"}
{"input": "Biotic", "output": "Describes living factors in the environment."}
{"input": "keystone species", "output": "a species on which other species in an ecosystem largely depend, such that if it were removed the ecosystem would change drastically."}
{"input": "primary consumer", "output": "An organism that eats producers"}
{"input": "secondary consumer", "output": "A carnivore that eats primary consumers"}
{"input": "tertiary consumer", "output": "A carnivore that eats secondary consumers"}
{"input": "Biodiversity", "output": "The amount of biological or living diversity per unit area. It includes the concepts of species diversity, habitat diversity and genetic diversity."}
{"input": "Divergent plates", "output": "Two tectonic plates that are moving away from each other"}
{"input": "convergent plates", "output": "tectonic plates that collide with each other"}
{"input": "Transform Plates", "output": "Plates that are moving past each other (rubbing next to each other) in opposite directions"}
{"input": "primary succession", "output": "succession that occurs on surfaces where no soil exists"}
{"input": "secondary succession", "output": "Succession following a disturbance that destroys a community without destroying the soil"}
{"input": "logistic growth", "output": "Growth pattern in which a population's growth rate slows or stops following a period of exponential growth"}
{"input": "logistic growth model", "output": "describes a population whose growth is initially exponential, but slows as the population approaches the carrying capacity of the environment"}
{"input": "exponential growth", "output": "Population growth that is unhindered because of the abundance of resources for an ever-increasing population."}
{"input": "exponential growth model", "output": "tells us that, under ideal conditions, the future size of the population depends on the current size of the population, the intrinsic rate of the population, and the amount of time over which the population grows"}
{"input": "intrinsic growth rate", "output": "the maximum potential for growth of a population under ideal conditions with unlimited resources"}
{"input": "K-selected species", "output": "Species that produce a few, often fairly large offspring but invest a great deal of time and energy to ensure that most of those offspring reach reproductive age."}
{"input": "r-selected species", "output": "Species that reproduce early in their life span and produce large numbers of usually small and short-lived offspring in a short period."}
{"input": "Generalists species", "output": "Species that can live in varying conditions"}
{"input": "Specialists species", "output": "Species with a narrow ecological niche. They may be able to live in only one type of habitat, tolerate only a narrow range of climatic and other environmental conditions, or use only one type or a few types of food."}
{"input": "Fault", "output": "A break or crack in the earth's crust"}
{"input": "Microevolution", "output": "Change in allele frequencies in a population over generations."}
{"input": "Macroevolution", "output": "Evolutionary change above the species level."}
{"input": "Algal Bloom", "output": "an immediate increase in the amount of algae and other producers that results from a large input of a limiting nutrient"}
{"input": "Limiting Nutrients", "output": "single essential nutrient that limits productivity in an ecosystem; Nitrogen, Phosphorus, Potassium"}
{"input": "Hypoxic", "output": "low oxygen"}
{"input": "Amenia", "output": "deficiency of iron"}
{"input": "Externality", "output": "the impact of one person's actions on the well-being of a bystander"}
{"input": "Affluence", "output": "abundance; wealth"}
{"input": "Leaching", "output": "the transportation of dissolved molecules through the soil via groundwater"}
{"input": "Resilience", "output": "the rate at which an ecosystem returns to its original state after a disturbance"}
{"input": "Resistance", "output": "a measure of how much a disturbance can affect flows of energy and matter in an ecosystem"}
{"input": "Watershed", "output": "An ecosystem where all water runoff drains into a single body of water"}
{"input": "Generalists", "output": "a species with a broad niche that can tolerate a wide range of conditions and can use a variety of resources"}
{"input": "Specialists", "output": "species that have narrow niches"}
{"input": "R-selected", "output": "Species that reproduce early in their life span and produce large numbers of usually small and short-lived offspring in a short period."}
{"input": "K-selected", "output": "Species that produce a few, often fairly large offspring but invest a great deal of time and energy to ensure that most of those offspring reach reproductive age."}
{"input": "Tragedy of the Commons", "output": "the tendency of a shared, limited resource to become depleted because people act from self-interest for short-term gain"}
{"input": "Stakeholders", "output": "All the people who stand to gain or lose by the policies and activities of a business and whose concerns the business needs to address."}
{"input": "Eutrophication", "output": "A process by which nutrients, particularly phosphorus and nitrogen, become highly concentrated in a body of water, leading to increased growth of organisms such as algae or cyanobacteria."}
{"input": "Mutualism", "output": "A relationship between two species in which both species benefit"}
{"input": "Commensalism", "output": "A relationship between two organisms in which one organism benefits and the other is unaffected"}
{"input": "Parasitism", "output": "A relationship between two organisms of different species where one benefits and the other is harmed"}
{"input": "Predation", "output": "An interaction in which one organism kills another for food."}
{"input": "Herbivory", "output": "interaction in which one animal (the herbivore) feeds on producers (such as plants)"}
{"input": "Carnivores", "output": "Consumers that eat only animals"}
{"input": "Omnivores", "output": "Consumers that eat both plants and animals."}
{"input": "Detrivore", "output": "a scavenger, such as an earthworm, that feeds on dead plant and animal matter"}
{"input": "Herbivores", "output": "Consumers that eat only plants"}
{"input": "Decomposers", "output": "organisms that break down wastes and dead organisms and return raw materials to the environment"}
{"input": "trophic level", "output": "each of several hierarchical levels in an ecosystem, comprising organisms that share the same function in the food chain and the same nutritional relationship to the primary sources of energy."}
{"input": "How much energy is available/consumed at each trophic level", "output": "10%"}
{"input": "genetic drift", "output": "A change in the allele frequency of a population as a result of chance events rather than natural selection."}
{"input": "Founder Effect", "output": "genetic drift that occurs after a small number of individuals colonize a new area"}
{"input": "Bottleneck Effect", "output": "Genetic drift resulting from the reduction of a population, typically by a natural disaster, such that the surviving population is no longer genetically representative of the original population."}
{"input": "Natural Selection", "output": "A natural process resulting in the evolution of organisms best adapted to the environment."}
{"input": "Sexual Selection", "output": "Natural selection for mating success."}
{"input": "intersexual selection", "output": "Selection whereby individuals of one sex (usually females) are choosy in selecting their mates from individuals of the other sex; also called mate choice."}
{"input": "intrasexual selection", "output": "competition among individuals of one sex (often males) for mates of the opposite sex"}
{"input": "sexual dimorphism", "output": "Differences in physical characteristics between males and females of the same species."}
{"input": "Soil Horizons", "output": "distinct layers of soil"}
{"input": "O horizon", "output": "the uppermost horizon of soil. It is primarily made up of organic material, including waste from organisms, the bodies of decomposing organisms, and live organisms."}
{"input": "A horizon", "output": "topsoil"}
{"input": "E horizon", "output": "Zone of leaching: dissolved and suspended materials move downward. In-between A and B horizon."}
{"input": "B horizon", "output": "A soil horizon composed primarily of mineral material with very little organic matter"}
{"input": "C horizon", "output": "The least-weathered soil horizon, which always occurs beneath the B horizon and is similar to the parent material."}
{"input": "R horizon", "output": "The bedrock, which lies below all of the other layers of soil, is referred to as the R horizon."}
{"input": "Atmosphere", "output": "the envelope of gases surrounding the earth or another planet."}
{"input": "Troposphere", "output": "0-17 km above Earth's surface, site of weather, organisms, contains most atmospheric water vapor. (temperature decreases with increasing altitude, pressure decreases)"}
{"input": "Stratosphere", "output": "2nd layer of atmosphere; extends from 10 to 30 miles up; location of ozone layer; absorbs 95% of Ultraviolet radiation; temperature increases with altitude increase."}
{"input": "Mesosphere", "output": "3rd layer of the atmosphere, above the stratosphere; most meteors, or space rocks and metal, burn up before they can crash to the ground"}
{"input": "Thermosphere", "output": "The uppermost layer of the atmosphere, in which temperature increases as altitude increases; contains the ionosphere"}
{"input": "fossil fuels", "output": "a natural fuel such as coal or gas, formed in the geological past from the remains of living organisms."}
{"input": "nuclear fuel", "output": "substance used in nuclear reactors that releases energy due to nuclear fission"}
{"input": "subsistence energy sources", "output": "those gathered by individuals for their own use such as wood, charcoal, and animal waste"}
{"input": "Commercial energy sources", "output": "Those that are bought and sold, (coal, oil, wood, etc)"}
{"input": "Cogeneration", "output": "The use of a single fuel to generate electricity and to produce heat"}
{"input": "coal", "output": "A fossil fuel that forms underground from partially decomposed plant material"}
{"input": "petroleum", "output": "A fossil fuel that occurs in underground deposits, composed of a liquid mixture of hydrocarbons, water, and sulfur"}
{"input": "crude oil", "output": "Liquid petroleum removed from the ground"}
{"input": "Natural gas", "output": "A gas with high methane content, found along with various fossil fuels and is used as a fuel."}
{"input": "oil sands", "output": "Slow-flowing, viscous deposits of bitumen mixed with sand, water, and clay"}
{"input": "Bitumen", "output": "A degraded petroleum that forms when petroleum migrates to the surface of Earth and is modified by bacteria."}
{"input": "CTL (coal to liquid)", "output": "The process of converting solid coal into liquid fuel"}
{"input": "Energy intensity", "output": "The energy use per unit of gross domestic product"}
{"input": "Hubbert curve", "output": "A bell-shaped curve representing oil use and projecting both when world oil production will reach a maximum and when we will run out of oil"}
{"input": "Peak Oil", "output": "The point at which half the total known oil supply is used up"}
{"input": "Fission", "output": "A nuclear reaction in which a massive nucleus splits into smaller nuclei with the simultaneous release of energy"}
{"input": "Radioactive waste", "output": "Nuclear fuel that can no longer produce enough heat to be useful in a power plant but continues to emit radioactivity"}
{"input": "Becquerel (Bq)", "output": "Unit that measures the rate at which a sample of radioactive material decays; 1 Bq = decay of 1 atom or nucleus per second."}
{"input": "Curie", "output": "A unit of measure for radiation; 1 curie = 37 billion decays per second."}
{"input": "Nuclear Fusion", "output": "A reaction that occurs when lighter nuclei are forced together to produce heavier nuclei"}
